#include "tasks.h"

/*	Task 02. The Average Number [среднее число]
 *
 *	Даны три различных числа.
 *	Определите среднее из них, т.е. то число, которое будет меньше одного из них
 *	и больше другого.
 *
 *	Примечание
 *	1) Не забудьте про "защиту от дурака": все три числа должны быть различными.
 *
 *	Формат входных данных [input]
 *	На вход функция принимает три различных целых числа типа int.
 *
 *	Формат выходных данных [output]
 *	Функция должна возвращать среднее по величине число или ноль,
 *	если числа не удовлетворяют условию задачи.
 *
 *	[ input 1]: 1 2 3
 *	[output 1]: 2
 *
 *	[ input 2]: 17 23 11
 *	[output 2]: 11
 *
 *	[ input 3]: 7 7 7
 *	[output 3]: 0
 *
 *	[ input 4]: 5 7 7
 *	[output 4]: 0
 */

int task02(int a, int b, int c) {
	
	int result = a < b && a > c || a > b && a < c ? a : 0;
	result = b < a && b > c || b > a && b < c ? b : result;
	return c < a && c > b || c > a && c < b ? c : result;
}